Repository: giellalt/corpus-sme
Catalog: tmx/nob/admin/sd/samediggi.no/sandra-marja-west.html.tmx
Source language: sme
Languages: nob

source: Sandra Márjá West / Áirasat / Sámedikki birra / Sámediggi - Sametinget
nob: Sandra Márjá West / Representanter / Om Sametinget / Forsiden - Sametinget

source: Sandra Márjá West
nob: Representant

source: sandra.marja.west@samediggi.no
nob: Samisk veiviser, Samisk Høgskole

source: Prosjektleder ved Riddu Riđđu, Indigenous Youth Gathering
nob: Medarbeider ved Tromsø Museum

source: Varamedlem i Riddu Riđđu Festival
nob: Assistent ved Universitetet i Tromsø

source: Varamedlem i Riddu Riđđu Searvi
nob: Prosjektmedarbeider ved Divvun-prosjektet, Sametinget
